app/controllers/charges_controller.rb

	def create
	  product = Product.find_by_sku("kittyOne")
	  # Amount in cents

	  customer = Stripe::Customer.create(
	    :email => params[:stripeEmail],
	    :source  => params[:stripeToken],
	    :plan => "CAT"
	  )


	  purchase = Purchase.create(email: params[:stripeEmail],card: params[:stripeToken],amount: product.price_in_cents, description: product.description, currency: "usd", customer_id: customer.id , product_id: product.id, uuid: SecureRandom.uuid)
---
SELECT  "products".* FROM "products" WHERE "products"."sku" = ? LIMIT ?  [["sku", "kittyOne"], ["LIMIT", 1]]
INSERT INTO "purchases" ("email", "amount", "description", "currency", "customer_id", "card", "product_id", "created_at", "updated_at", "uuid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)